Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mengzi__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 齊宣王見孟子於雪宮。王曰：「賢者亦有此樂乎？」孟子對曰：「有。人不得，則非其上矣。不得而非其上者，非也；為民上，而不與民同樂者，亦非也。樂民之樂者，民亦樂其樂；憂民之憂者，民亦憂其憂。樂以天下，憂以天下；然而不王者，未之有也。昔者齊景公問於晏子曰：『吾欲觀於轉附、朝舞，遵海而南，放於琅邪；吾何修而可以比於先王觀也？晏子對曰：『善哉問也！天子適諸侯曰巡狩。巡狩者，巡所守也。諸侯朝於天子曰述職。述職者，述所職也。無非事者。春省耕而補不足，秋省斂而助不給。夏諺曰：『吾王不游，吾何以休？吾王不豫，吾何以助？一遊一豫，為諸侯度。』今也不然：師行而糧食，饑者弗食，勞者弗息；睊睊胥讒，民乃作慝。方命虐民，飲食若流；流連荒亡，為諸侯憂。從流下而忘反，謂之流；從流上而忘反，謂之連；從獸無厭，謂之荒；樂酒無厭，謂之亡。先王無流連之樂，荒亡之行。惟君所行也。景公說，大戒於國，出捨於郊。於是始興發補不足。召大師曰：『為我作君臣相說之樂。』蓋徴招、角招是也。其詩曰：『畜君何尤？』畜君者，好君也。」
en: The king Xuan of Qi had an interview with Mencius in the Snow palace, and said to him, 'Do men of talents and worth likewise find pleasure in these things?' Mencius replied, 'They do; and if people generally are not able to enjoy themselves, they condemn their superiors. For them, when they cannot enjoy themselves, to condemn their superiors is wrong, but when the superiors of the people do not make enjoyment a thing common to the people and themselves, they also do wrong. When a ruler rejoices in the joy of his people, they also rejoice in his joy; when he grieves at the sorrow of his people, they also grieve at his sorrow. A sympathy of joy will pervade the kingdom; a sympathy of sorrow will do the same - in such a state of things, it cannot be but that the ruler attain to the royal dignity. 'Formerly, the duke Jing of Qi asked the minister Yan, saying, "I wish to pay a visit of inspection to Zhuan Fu, and Chao Wu, and then to bend my course southward along the shore, till I come to Lang Xie. What shall I do that my tour may be fit to be compared with the visits of inspection made by the ancient sovereigns?" The minister Yan replied, "An excellent inquiry! When the Son of Heaven visited the princes, it was called a tour of inspection, that is, be surveyed the States under their care. When the princes attended at the court of the Son of Heaven, it was called a report of office, that is, they reported their administration of their offices. Thus, neither of the proceedings was without a purpose. And moreover, in the spring they examined the ploughing, and supplied any deficiency of seed; in the autumn they examined the reaping, and supplied any deficiency of yield. There is the saying of the Xia dynasty - If our king do not take his ramble, what will become of our happiness? If our king do not make his excursion, what will become of our help? That ramble, and that excursion, were a pattern to the princes. Now, the state of things is different. A host marches in attendance on the ruler, and stores of provisions are consumed. The hungry are deprived of their food, and there is no rest for those who are called to toil. Maledictions are uttered by one to another with eyes askance, and the people proceed to the commission of wickedness. Thus the royal ordinances are violated, and the people are oppressed, and the supplies of food and drink flow away like water. The rulers yield themselves to the current, or they urge their way against it; they are wild; they are utterly lost - these things proceed to the grief of the inferior princes. Descending along with the current, and forgetting to return, is what I call yielding to it. Pressing up against it, and forgetting to return, is what I call urging their way against it. Pursuing the chase without satiety is what I call being wild. Delighting in wine without satiety is what I call being lost. The ancient sovereigns had no pleasures to which they gave themselves as on the flowing stream; no doings which might be so characterized as wild and lost. It is for you, my prince, to pursue your course." The duke Ching was pleased. He issued a proclamation throughout his State, and went out and occupied a shed in the borders. From that time he began to open his granaries to supply the wants of the people, and calling the Grand music-master, he said to him "Make for me music to suit a prince and his minister pleased with each other." And it was then that the Zheng Zhao and Jiao Zhao were made, in the words to which it was said, "Is it a fault to restrain one's prince?" He who restrains his prince loves his prince.'

source: 齊宣王問曰：「人皆謂我毀明堂，毀諸？已乎？」孟子對曰：「夫明堂者，王者之堂也。王欲行王政，則勿毀之矣。」王曰：「王政可得聞與？」對曰：「昔者文王之治岐也，耕者九一，仕者世祿，關市譏而不征，澤梁無禁，罪人不孥。老而無妻曰鰥，老而無夫曰寡，老而無子曰獨，幼而無父曰孤。此四者，天下之窮民而無告者。文王發政施仁，必先斯四者。詩云，『哿矣富人，哀此煢獨。』」王曰：「善哉言乎！」曰：「王如善之，則何為不行？」王曰：「寡人有疾，寡人好貨。」對曰：「昔者公劉好貨，《詩》云：『乃積乃倉，乃裹餱糧，於橐於囊。思戢用光。弓矢斯張，干戈戚揚，爰方啟行。』故居者有積倉，行者有裹糧也，然後可以爰方啟行。王如好貨，與百姓同之，於王何有？」王曰：「寡人有疾，寡人好色。」對曰：「昔者大王好色，愛厥妃。《詩》云：『古公亶父，來朝走馬；率西水滸，至於岐下；爰及姜女，聿來胥宇。』當是時也，內無怨女，外無曠夫；王如好色，與百姓同之，於王何有？」
en: The king Xuan of Qi said, 'People all tell me to pull down and remove the Hall of Distinction. Shall I pull it down, or stop the movement for that object?' Mencius replied, 'The Hall of Distinction is a Hall appropriate to the sovereigns. If your Majesty wishes to practise the true royal government, then do not pull it down.' The king said, 'May I hear from you what the true royal government is?' 'Formerly,' was the reply, 'king Wen's government of Qi was as follows: The husbandmen cultivated for the government one-ninth of the land; the descendants of officers were salaried; at the passes and in the markets, strangers were inspected, but goods were not taxed: there were no prohibitions respecting the ponds and weirs; the wives and children of criminals were not involved in their guilt. There were the old and wifeless, or widowers; the old and husbandless, or widows; the old and childless, or solitaries; the young and fatherless, or orphans - these four classes are the most destitute of the people, and have none to whom they can tell their wants, and king Wen, in the institution of his government with its benevolent action, made them the first objects of his regard, as it is said in the Book of Poetry, "The rich may get through life well; But alas! for the miserable and solitary!"' The king said, 'O excellent words!' Mencius said, 'Since your Majesty deems them excellent, why do you not practise them?' 'I have an infirmity,' said the king; 'I am fond of wealth.' The reply was, 'Formerly, Gong Liu was fond of wealth. It is said in the Book of Poetry, "He reared his ricks, and filled his granaries, He tied up dried provisions and grain, In bottomless bags, and sacks, That he might gather his people together, and glorify his State. With bows and arrows all-displayed, With shields, and spears, and battle-axes, large and small, He commenced his march." In this way those who remained in their old seat had their ricks and granaries, and those who marched had their bags of provisions. It was not till after this that he thought he could begin his march. If your Majesty loves wealth, give the people power to gratify the same feeling, and what difficulty will there be in your attaining the royal sway?' The king said, 'I have an infirmity; I am fond of beauty.' The reply was, 'Formerly, king Tai was fond of beauty, and loved his wife. It is said in the Book of Poetry, "Gu Gong Tan Fu, Came in the morning, galloping his horse, By the banks of the western waters, As far as the foot of Qi hill, Along with the lady of Jiang; They came and together chose the site for their settlement." At that time, in the seclusion of the house, there were no dissatisfied women, and abroad, there were no unmarried men. If your Majesty loves beauty, let the people be able to gratify the same feeling, and what difficulty will there be in your attaining the royal sway?'

source: 孟子謂齊宣王，曰：「王之臣有托其妻子於其友而之楚游者，比其反也，則凍餒其妻子，則如之何？」王曰：「棄之。」曰：「士師不能治士，則如之何？」王曰：「已之。」曰：「四境之內不治，則如之何？」王顧左右而言他。
en: Mencius said to the king Xuan of Qi, 'Suppose that one of your Majesty's ministers were to entrust his wife and children to the care of his friend, while he himself went into Chu to travel, and that, on his return, he should find that the friend had let his wife and children suffer from cold and hunger - how ought he to deal with him?' The king said, 'He should cast him off.' Mencius proceeded, 'Suppose that the chief criminal judge could not regulate the officers under him, how would you deal with him?' The king said, 'Dismiss him.' Mencius again said, 'If within the four borders of your kingdom there is not good government, what is to be done?' The king looked to the right and left, and spoke of other matters.

source: 孟子見齊宣王，曰：「所謂故國者，非謂有喬木之謂也，有世臣之謂也。王無親臣矣，昔者所進，今日不知其亡也。」王曰：「吾何以識其不才而捨之？」曰：「國君進賢，如不得已，將使卑逾尊，疏逾戚，可不慎與？左右皆曰賢，未可也；諸大夫皆曰賢，未可也；國人皆曰賢，然後察之；見賢焉，然後用之。左右皆曰不可，勿聽；諸大夫皆曰不可，勿聽；國人皆曰不可，然後察之；見不可焉，然後去之。左右皆曰可殺，勿聽；諸大夫皆曰可殺，勿聽；國人皆曰可殺，然後察之，見可殺焉，然後殺之。故曰，國人殺之也。如此，然後可以為民父母。」
en: Mencius, having an interview with the king Xuan of Qi, said to him, 'When men speak of "an ancient kingdom," it is not meant thereby that it has lofty trees in it, but that it has ministers sprung from families which have been noted in it for generations. Your Majesty has no intimate ministers even. Those whom you advanced yesterday are gone to-day, and you do not know it.' The king said, 'How shall I know that they have not ability, and so avoid employing them at all?' The reply was, 'The ruler of a State advances to office men of talents and virtue only as a matter of necessity. Since he will thereby cause the low to overstep the honourable, and distant to overstep his near relatives, ought he to do so but with caution? When all those about you say, "This is a man of talents and worth," you may not therefore believe it. When your great officers all say, "This is a man of talents and virtue," neither may you for that believe it. When all the people say, "This is a man of talents and virtue," then examine into the case, and when you find that the man is such, employ him. When all those about you say, "This man won't do," don't listen to them. When all your great officers say, "This man won't do," don't listen to them. When the people all sav, "This man won't do," then examine into the case, and when you find that the man won't do, send him away. When all those about you say, "This man deserves death," don't listen to them. When all your great officers say, "This man deserves death," don't listen to them. When the people all say, "This man deserves death," then inquire into the case, and when you see that the man deserves death, put him to death. In accordance with this we have the saying, "The people killed him." You must act in this way in order to be the parent of the people.'

source: 齊宣王問曰：「湯放桀，武王伐紂，有諸？」孟子對曰：「於傳有之。」曰：「臣弒其君可乎？」曰：「賊仁者謂之『賊』，賊義者謂之『殘』。殘賊之人謂之『一夫』。聞誅一夫紂矣，未聞弒君也。」
en: The king Xuan of Qi asked, saying, 'Was it so, that Tang banished Jie, and that king Wu smote Zhou?' Mencius replied, 'It is so in the records.' The king said, 'May a minister then put his sovereign to death?' Mencius said, 'He who outrages the benevolence proper to his nature, is called a robber; he who outrages righteousness, is called a ruffian. The robber and ruffian we call a mere fellow. I have heard of the cutting off of the fellow Zhou, but I have not heard of the putting a sovereign to death, in his case.'

source: 孟子見齊宣王，曰：「為巨室，則必使工師求大木。工師得大木，則王喜，以為能勝其任也。匠人斫而小之，則王怒，以為不勝其任矣。夫人幼而學之，壯而欲行之，王曰：『姑捨女所學而從我』，則何如？今有璞玉於此，雖萬鎰，必使玉人雕琢之。至於治國家，則曰：『姑捨女所學而從我』，則何以異於教玉人雕琢玉哉？」
en: Mencius, having an interview with the king Xuan of Qi, said to him, 'If you are going to build a large mansion, you will surely cause the Master of the workmen to look out for large trees, and when he has found such large trees, you will be glad, thinking that they will answer for the intended object. Should the workmen hew them so as to make them too small, then your Majesty will be angry, thinking that they will not answer for the purpose. Now, a man spends his youth in learning the principles of right government, and, being grown up to vigour, he wishes to put them in practice; if your Majesty says to him, "For the present put aside what you have learned, and follow me," what shall we say? Here now you have a gem unwrought, in the stone. Although it may be worth 240,000 taels, you will surely employ a lapidary to cut and polish it. But when you come to the government of the State, then you say, "For the present put aside what you have learned, and follow me." How is it that you herein act so differently from your conduct in calling in the lapidary to cut the gem?'

source: 齊人伐燕，勝之。宣王問曰：「或謂寡人勿取，或謂寡人取之。以萬乘之國伐萬乘之國，五旬而舉之，人力不至於此。不取必有天殃。取之何如？」孟子對曰：「取之而燕民悅，則取之。古之人有行之者，武王是也。取之而燕民不悅，則勿取，古之人有行之者，文王是也。以萬乘之國伐萬乘之國，簞食壺漿以迎王師，豈有他哉？避水火也。如水益深，如火益熱，亦運而已矣。」
en: The people of Qi attacked Yan, and conquered it. The king Xuan asked, saying, 'Some tell me not to take possession of it for myself, and some tell me to take possession of it. For a kingdom of ten thousand chariots, attacking another of ten thousand chariots, to complete the conquest of it in fifty days, is an achievement beyond mere human strength. If I do not take possession of it, calamities from Heaven will surely come upon me. What do you say to my taking possession of it?' Mencius replied, 'If the people of Yan will be pleased with your taking possession of it, then do so. Among the ancients there was one who acted on this principle, namely king Wu. If the people of Yan will not be pleased with your taking possession of it, then do not do so. Among the ancients there was one who acted on this principle, namely king Wen. When, with all the strength of your country of ten thousand chariots, you attacked another country of ten thousand chariots, and the people brought baskets of rice and vessels of congee, to meet your Majesty's host, was there any other reason for this but that they hoped to escape out of fire and water? If you make the water more deep and the fire more fierce, they will in like manner make another revolution.'

source: 齊人伐燕，取之。諸侯將謀救燕。宣王曰：「諸侯多謀伐寡人者，何以待之？」孟子對曰：「臣聞七十里為政於天下者，湯是也。未聞以千里畏人者也。書曰：『湯一征，自葛始。」天下信之，東面而征，西夷怨；南面而征，北狄怨曰：『奚為後我？』民望之，若大旱之望雲霓也。歸市者不止，耕者不變。誅其君而弔其民，若時雨降。民大悅。書曰：『徯我后，后來其蘇。』今燕虐其民，王往而征之，民以為將拯己於水火之中也，簞食壺漿以迎王師。若殺其兄父，係累其子弟，毀其宗廟，遷其重器，如之何其可也？天下固畏齊之強也，今又倍地而不行仁政，是動天下之兵也。王速出令，反其旄倪，止其重器，謀於燕眾，置君而後去之，則猶可及止也。」
en: The people of Qi, having smitten Yan, took possession of it, and upon this, the princes of the various States deliberated together, and resolved to deliver Yan from their power. The king Xuan said to Mencius, 'The princes have formed many plans to attack me - how shall I prepare myself for them?' Mencius replied, 'I have heard of one who with seventy li exercised all the functions of government throughout the kingdom. That was Tang. I have never heard of a prince with a thousand li standing in fear of others. It is said in the Book of History, As soon as Tang began his work of executing justice, he commenced with Ge. The whole kingdom had confidence in him. When he pursued his work in the east, the rude tribes on the west murmured. So did those on the north, when he was engaged in the south. Their cry was "Why does he put us last?" Thus, the people looked to him, as we look in a time of great drought to the clouds and rainbows. The frequenters of the markets stopped not. The husbandmen made no change in their operations. While he punished their rulers, he consoled the people. His progress was like the falling of opportune rain, and the people were delighted. It is said again in the Book of History, "We have waited for our prince long; the prince's coming will be our reviving!" 'Now the ruler of Yan was tyrannizing over his people, and your Majesty went and punished him. The people supposed that you were going to deliver them out of the water and the fire, and brought baskets of rice and vessels of congee, to meet your Majesty's host. But you have slain their fathers and elder brothers, and put their sons and younger brothers in confinement. You have pulled down the ancestral temple of the State, and are removing to Qi its precious vessels. How can such a course be deemed proper? The rest of the kingdom is indeed jealously afraid of the strength of Qi; and now, when with a doubled territory you do not put in practice a benevolent government - it is this which sets the arms of the kingdom in in motion. If your Majesty will make haste to issue an ordinance, restoring your captives, old and young, stopping the removal of the precious vessels, and saying that, after consulting with the people of Yen, you will appoint them a ruler, and withdraw from the country - in this way you may still be able to stop the threatened attack.'

source: 鄒與魯鬨。穆公問曰：「吾有司死者三十三人，而民莫之死也。誅之，則不可勝誅；不誅，則疾視其長上之死而不救，如之何則可也？」孟子對曰：「凶年饑歲，君之民老弱轉乎溝壑，壯者散而之四方者，幾千人矣；而君之倉廩實，府庫充，有司莫以告，是上慢而殘下也。曾子曰：『戒之戒之！出乎爾者，反乎爾者也。』夫民今而後得反之也。君無尤焉！君行仁政，斯民親其上，死其長矣。」
en: There had been a brush between Zou and Lu, when the duke Mu asked Mencius, saying,'Of my officers there were killed thirty-three men, and none of the people would die in their defence. Though I sentenced them to death for their conduct, it is impossible to put such a multitude to death. If I do not put them to death, then there is the crime unpunished of their looking angrily on at the death of their officers, and not saving them. How is the exigency of the case to be met?' Mencius replied, 'In calamitous years and years of famine, the old and weak of your people, who have been found lying in the ditches and water-channels, and the able-bodied who have been scattered about to the four quarters, have amounted to several thousands. All the while, your granaries, 0 prince, have been stored with grain, and your treasuries and arsenals have been full, and not one of your officers has told you of the distress. Thus negligent have the superiors in your State been, and cruel to their inferiors. The philosopher Zeng said, "Beware, beware. What proceeds from you, will return to you again." Now at length the people have paid back the conduct of their officers to them. Do not you, 0 prince, blame them. If you will put in practice a benevolent government, this people will love you and all above them, and will die for their officers.'

source: 滕文公問曰：「滕，小國也，間於齊、楚。事齊乎？事楚乎？」孟子對曰：「是謀非吾所能及也。無已，則有一焉：鑿斯池也，築斯城也，與民守之，效死而民弗去，則是可為也。」
en: The duke Wen of Teng asked Mencius, saying, 'Teng is a small kingdom, and lies between Qi and Chu. Shall I serve Qi? Or shall I serve Chu?' Mencius replied, 'This plan which you propose is beyond me. If you will have me counsel you, there is one thing I can suggest. Dig deeper your moats; build higher your walls; guard them as well as your people. In case of attack, be prepared to die in your defence, and have the people so that they will not leave you - this is a proper course.'

source: 滕文公問曰：「齊人將築薛，吾甚恐，如之何則可？」孟子對曰：「昔者大王居邠，狄人侵之，去之岐山之下居焉。非擇而取之，不得已也。苟為善，後世子孫必有王者矣。君子創業垂統，為可繼也。若夫成功，則天也。君如彼何哉？強為善而已矣。」
en: The duke Wen of Teng asked Mencius, saying, 'The people of Qi are going to fortify Xue. The movement occasions me great alarm. What is the proper course for me to take in the case?' Mencius replied, 'Formerly, when king Tai dwelt in Bin, the barbarians of the north were continually making incursions upon it. He therefore left it, went to the foot of mount Qi, and there took up his residence. He did not take that situation, as having selected it. It was a matter of necessity with him. If you do good, among your descendants, in after generations, there shall be one who will attain to the royal dignity. A prince lays the foundation of the inheritance, and hands down the beginning which he has made, doing what may be continued by his successors. As to the accomplishment of the great result, that is with Heaven. What is that Qi to you, 0 prince? Be strong to do good. That is all your business.'

source: 滕文公問曰：「滕，小國也；竭力以事大國，則不得免焉，如之何則可？」孟子對曰：「昔者大王居邠，狄人侵之。事之以皮幣，不得免焉；事之以犬馬，不得免焉；事之以珠玉，不得免焉。乃屬其耆老而告之曰：『狄人之所欲者，吾土地也。吾聞之也：君子不以其所以養人者害人。二三子何患乎無君？我將去之。』去邠，逾梁山，邑於岐山之下居焉。邠人曰：『仁人也，不可失也。』從之者如歸市。或曰：『世守也，非身之所能為也。效死勿去。』君請擇於斯二者。」
en: The duke Wen of Teng asked Mencius, saying, 'Teng is a small State. Though I do my utmost to serve those large kingdoms on either side of it, we cannot escape suffering from them. What course shall I take that we may do so?' Mencius replied, 'Formerly, when king Tai dwelt in Bin, the barbarians of the north were constantly making incursions upon it. He served them with skins and silks, and still he suffered from them. He served them with dogs and horses, and still he suffered from them. He served them with pearls and gems, and still he suffered from them. Seeing this, he assembled the old men, and announced to them, saying, "What the barbarians want is my territory. I have heard this - that a ruler does not injure his people with that wherewith he nourishes them. My children, why should you be troubled about having no prince? I will leave this." Accordingly, he left Bin, crossed the mountain Liang, built a town at the foot of mount Qi, and dwelt there. The people of Pin said, "He is a benevolent man. We must not lose him." Those who followed him looked like crowds hastening to market. On the other hand, some say, "The kingdom is a thing to be kept from generation to generation. One individual cannot undertake to dispose of it in his own person. Let him be prepared to die for it. Let him not quit it." I ask you, prince, to make your election between these two courses.'

source: 魯平公將出，嬖人臧倉者請曰：「他日君出，則必命有司所之。今乘輿已駕矣，有司未知所之，敢請。」公曰：「將見孟子。」曰：「何哉，君所為輕身以先於匹夫者？以為賢乎？禮義由賢者出；而孟子之後喪逾前喪。君無見焉！」公曰：「諾。」樂正子入見，曰：「君奚為不見孟軻也？」曰：「或告寡人曰，『孟子之後喪逾前喪』，是以不往見也。」曰：「何哉，君所謂逾者？前以士，後以大夫；前以三鼎，而後以五鼎與？」曰：「否，謂棺槨衣衾之美也。」曰：「非所謂逾也，貧富不同也。」樂正子見孟子，曰：「克告於君，君為來見也。嬖人有臧倉者沮君，君是以不果來也。」曰：「行或使之；止或尼之。行、止，非人所能也。吾之不遇魯侯，天也。臧氏之子，焉能使予不遇哉？」
en: The duke Ping of Lu was about to leave his palace, when his favourite, one Zang Cang, made a request to him, saying, 'On other days, when you have gone out, you have given instructions to the officers as to where you were going. But now, the horses have been put to the carriage, and the officers do not yet know where you are going. I venture to ask.' The duke said, 'I am going to see the scholar Meng.' 'How is this?' said the other. 'That you demean yourself, prince, in paying the honour of the first visit to a common man, is, I suppose, because you think that he is a man of talents and virtue. By such men the rules of ceremonial proprieties and right are observed. But on the occasion of this Meng's second mourning, his observances exceeded those of the former. Do not go to see him, my prince.' The duke said, 'I will not.' The officer Yue Zheng entered the court, and had an audience. He said, 'Prince, why have you not gone to see Meng Ke?' the duke said, 'One told me that, on the occasion of the scholar Meng's second mourning, his observances exceeded those of the former. It is on that account that I have not gone to see him.' 'How is this!' answered Yue Zheng. 'By what you call "exceeding," you mean, I suppose, that, on the first occasion, he used the rites appropriate to a scholar, and, on the second, those appropriate to a great officer; that he first used three tripods, and afterwards five tripods.' The duke said, 'No; I refer to the greater excellence of the coffin, the shell, the grave-clothes, and the shroud.' Yo-chAng said, 'That cannot be called "exceeding." That was the difference between being poor and being rich.' After this, Yue Zheng saw Mencius, and said to him, 'I told the prince about you, and he was consequently coming to see you, when one of his favourites, named Zang Cang, stopped him, and therefore he did not come according to his purpose.' Mencius said, 'A man's advancement is effected, it may be, by others, and the stopping him is, it may be, from the efforts of others. But to advance a man or to stop his advance is really beyond the power of other men. My not finding in the prince of Lu a ruler who would confide in me, and put my counsels into practice, is from Heaven. How could that scion of the Zang family cause me not to find the ruler that would suit me?'
